labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_HC05/LIB_HC05.cpp
    if(answer == 1)
      return true;
  else
      return false;

/* 
  device_class = 0;

  char response[40];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+CLASS:");
  const char *class_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_CLASS);

  if (m_errCode != HC05_OK)
    return false;

  if (!class_part)
    return hc05.readOperationResult() && false;

  device_class = htoul(class_part);

  return hc05.readOperationResult();
 */



}

/****************************************************************
*FUNCTION NAME:setDeviceClass
*FUNCTION     :set Device Class
*INPUT        :device_class , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setDeviceClass(uint32_t device_class, unsigned long timeout)
{
  char temp[10];
  uint8_t answer;
  //PGM_STRING_MAPPED_TO_RAM(format, "%lx");
  snprintf(temp, sizeof(temp), "AT+CLASS=%lx", device_class);

 // PGM_STRING_MAPPED_TO_RAM(command, "CLASS=");
    
  answer =hc05.sendAtCommand(temp, timeout, 0);
  debugTerminal("HC05_setDeviceClass");
  

  if(answer == 1)
      return true;
  else
      return false;

  }

/****************************************************************
*FUNCTION NAME:getInquiryAccessCode
*FUNCTION     :getInquiryAccessCode
*INPUT        :iac , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getInquiryAccessCode(uint32_t &iac, unsigned long timeout)
{
  startOperation(timeout);

 // PGM_STRING_MAPPED_TO_RAM(command, "IAC?");
  uint8_t answer; 
   answer = hc05.sendAtCommand("AT+IAC?\r\n", timeout, 0);
  debugTerminal("HC05_getInquiryAccessCode");
    if(answer == 1)
      return true;
  else
      return false;

/* 
  iac = 0;

  if (isOperationTimedOut())
    return false;

  char response[30];
  
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+IAC:");
  const char *iac_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_IAC);

  if (m_errCode != HC05_OK)
    return false;

  if (!iac_part)
    return hc05.readOperationResult() && false;

  iac = htoul(iac_part);

  return hc05.readOperationResult(); */

}

/****************************************************************
*FUNCTION NAME:setInquiryAccessCode
*FUNCTION     :setInquiryAccessCode
*INPUT        :iac , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setInquiryAccessCode(uint32_t iac, unsigned long timeout)
{
  char iac_str[20];
  uint8_t answer;
  //PGM_STRING_MAPPED_TO_RAM(format, "%lx");
  snprintf(iac_str, sizeof(iac_str), "AT+IAC=%lx", iac);

  //PGM_STRING_MAPPED_TO_RAM(command, "IAC=");
  answer =hc05.sendAtCommand(iac_str, timeout, 0);
  debugTerminal("HC05_getInquiryAccessCode");

  if(answer == 1)
      return true;
  else
      return false;
}

/****************************************************************
*FUNCTION NAME:getInquiryMode
*FUNCTION     :getInquiryMode
*INPUT        :inq_mode , max_devices , max_duration , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getInquiryMode(HC05_InquiryMode &inq_mode,
  int16_t &max_devices, uint8_t &max_duration, unsigned long timeout)
{
  startOperation(timeout);

  //PGM_STRING_MAPPED_TO_RAM(command, "INQM?");
  uint8_t answer; 
   answer = hc05.sendAtCommand("AT+INQM?\r\n", timeout, 0);
  debugTerminal("HC05_getInquiryMode");
    if(answer == 1)
      return true;
  else
      return false;
/* 
  inq_mode = HC05_INQUIRY_STANDARD;
  max_devices = 0;
  max_duration = 0;

  char response[30];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+INQM:");
  char *mode_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_INQM);

  if (m_errCode != HC05_OK)
    return false;

  if (!mode_part)
    return hc05.readOperationResult() && false;

  inq_mode = static_cast<HC05_InquiryMode>(atol(mode_part));
  mode_part = strchrnul(mode_part, ',');

  if (*mode_part != ',')
    return hc05.readOperationResult() && false;

  max_devices = atol(++mode_part);
  mode_part = strchrnul(mode_part, ',');

  if (*mode_part != ',')
    return hc05.readOperationResult() && false;

  max_duration = atol(++mode_part);

  return hc05.readOperationResult();
 */

}

/****************************************************************
*FUNCTION NAME:setInquiryMode
*FUNCTION     :setInquiryMode
*INPUT        :inq_mode , max_devices , max_duration , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::setInquiryMode(HC05_InquiryMode inq_mode,
  int16_t max_devices, uint8_t max_duration, unsigned long timeout)
{
  char mode[20];
  uint8_t answer;
  
  /* Yeah, max_devices is signed 16-bit integer, but the module accepts
   * an unsigned 16-bit integer while actually interpreting it as signed.
   *                          <-^->
   * Tricky chinese engineers (-_-)
   *                            "
   */
  
  //PGM_STRING_MAPPED_TO_RAM(format, "%d,%u,%u");
  snprintf(mode, sizeof(mode), "AT+INQM=%d,%u,%u", inq_mode, (uint16_t)max_devices, max_duration);

  //PGM_STRING_MAPPED_TO_RAM(command, "INQM=");
    
  answer =hc05.sendAtCommand(mode, timeout, 0);
  debugTerminal("HC05_setInquiryMode");

  if(answer == 1)
      return true;
  else
      return false;
}

/****************************************************************
*FUNCTION NAME:getPassword
*FUNCTION     :getPassword
*INPUT        :buffer , timeout
*OUTPUT       :bool
****************************************************************/
bool LIB_HC05::getPassword(char *buffer, unsigned long timeout)
{
  startOperation(timeout);  

  if (!buffer)
  {
    m_errCode = HC05_FAIL;
    return false;
  }

  //PGM_STRING_MAPPED_TO_RAM(command, "PSWD?");
  uint8_t answer; 
   answer = hc05.sendAtCommand("AT+PSWD?\r\n", timeout, 0);
  debugTerminal("HC05_getPassword");
    if(answer == 1)
      return true;
  else
      return false;
/* 
  char response[HC05_PASSWORD_MAXLEN + 15];
  //PGM_STRING_MAPPED_TO_RAM(response_pattern, "+PSWD:");
  const char *password_part = hc05.readResponseWithPrefix(
    response, sizeof(response), AT_RESP_PSWD);

  if (m_errCode != HC05_OK)
  {
    *buffer = 0;
    return false;
  }

  if (!password_part)
  {
    *buffer = 0;
    return hc05.readOperationResult() && false;
  }

  //PGM_STRING_MAPPED_TO_RAM(format, "%s");
  snprintf(buffer, HC05_PASSWORD_BUFSIZE, "%s", password_part);

  return hc05.readOperationResult();
 */  



